; domain
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (domain sailing)
     (:requirements :typing :fluents)
     (:types
          boat person - object
     )
     (:predicates
          (saved ?t - person)
     )
     (:functions
          (x ?b - boat)
          (y ?b - boat)
          (d ?t - person)
     )
     ;; Increment the value in the given counter by one
     (:action go_north_east
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(increase (x ?b) 1.5) (increase (y ?b) 1.5))
     )
     (:action go_north_west
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(decrease (x ?b) 1.5) (increase (y ?b) 1.5))
     )
     (:action go_est
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(increase (x ?b) 3))
     )
     (:action go_west
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(decrease (x ?b) 3))
     )
     (:action go_south_west
          :parameters(?b - boat)
          :precondition (and)
          :effect (and(increase (x ?b) 2) (decrease (y ?b) 2))
     )
     (:action go_south_east
          :parameters(?b - boat)
          :precondition (and)
          :effect (and(decrease (x ?b) 2) (decrease (y ?b) 2))
     )
     (:action go_south
          :parameters(?b - boat)
          :precondition (and)
          :effect (and (decrease (y ?b) 2))
     )
     (:action save_person
          :parameters(?b - boat ?t - person)
          :precondition ( and (>= (+ (x ?b) (y ?b)) (d ?t))
               (>= (- (y ?b) (x ?b)) (d ?t))
               (<= (+ (x ?b) (y ?b)) (+ (d ?t) 25))
               (<= (- (y ?b) (x ?b)) (+ (d ?t) 25))
          )
          :effect (and(saved ?t))
     )

)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_14_19)

	(:domain sailing)

	(:objects
		b0 b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 - boat
		p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 p15 p16 p17 p18 - person
	)

  (:init
		(= (x b0) 9)
(= (y b0) 0)
(= (x b1) -2)
(= (y b1) 0)
(= (x b2) -8)
(= (y b2) 0)
(= (x b3) -9)
(= (y b3) 0)
(= (x b4) 8)
(= (y b4) 0)
(= (x b5) -1)
(= (y b5) 0)
(= (x b6) 8)
(= (y b6) 0)
(= (x b7) 3)
(= (y b7) 0)
(= (x b8) 1)
(= (y b8) 0)
(= (x b9) 4)
(= (y b9) 0)
(= (x b10) -5)
(= (y b10) 0)
(= (x b11) 5)
(= (y b11) 0)
(= (x b12) -8)
(= (y b12) 0)
(= (x b13) -2)
(= (y b13) 0)

		(= (d p0) 70)
(= (d p1) 9)
(= (d p2) 65)
(= (d p3) 38)
(= (d p4) 7)
(= (d p5) 68)
(= (d p6) 93)
(= (d p7) 10)
(= (d p8) 26)
(= (d p9) 68)
(= (d p10) 68)
(= (d p11) 79)
(= (d p12) 46)
(= (d p13) 2)
(= (d p14) 11)
(= (d p15) 78)
(= (d p16) 69)
(= (d p17) 54)
(= (d p18) 79)

	)

	(:goal
		(and
			(saved p0)
(saved p1)
(saved p2)
(saved p3)
(saved p4)
(saved p5)
(saved p6)
(saved p7)
(saved p8)
(saved p9)
(saved p10)
(saved p11)
(saved p12)
(saved p13)
(saved p14)
(saved p15)
(saved p16)
(saved p17)
(saved p18)
		)
	)
)

; plan
1. (go_north_west b8)
   changed: (x b8) from 1 to -0.5, (y b8) from 0 to 1.5
   goals met: 0 of 19
2. (go_north_west b8)
   changed: (x b8) from -0.5 to -2, (y b8) from 1.5 to 3
   goals met: 0 of 19
3. (go_north_west b8)
   changed: (x b8) from -2 to -3.5, (y b8) from 3 to 4.5
   goals met: 0 of 19
4. (go_north_west b8)
   changed: (x b8) from -3.5 to -5, (y b8) from 4.5 to 6
   goals met: 0 of 19
5. (go_north_west b8)
   changed: (x b8) from -5 to -6.5, (y b8) from 6 to 7.5
   goals met: 0 of 19
6. (go_north_west b8)
   changed: (x b8) from -6.5 to -8, (y b8) from 7.5 to 9
   goals met: 0 of 19
7. (go_north_west b8)
   changed: (x b8) from -8 to -9.5, (y b8) from 9 to 10.5
   goals met: 0 of 19
8. (go_north_west b8)
   changed: (x b8) from -9.5 to -11, (y b8) from 10.5 to 12
   goals met: 0 of 19
9. (go_north_west b8)
   changed: (x b8) from -11 to -12.5, (y b8) from 12 to 13.5
   goals met: 0 of 19
10. (go_north_east b8)
   changed: (x b8) from -12.5 to -11, (y b8) from 13.5 to 15
   goals met: 0 of 19
11. (save_person b8 p13)
   added: (saved p13)
   goals met: 1 of 19
12. (go_north_west b8)
   changed: (x b8) from -11 to -12.5, (y b8) from 15 to 16.5
   goals met: 1 of 19
13. (go_north_west b8)
   changed: (x b8) from -12.5 to -14, (y b8) from 16.5 to 18
   goals met: 1 of 19
14. (go_north_east b8)
   changed: (x b8) from -14 to -12.5, (y b8) from 18 to 19.5
   goals met: 1 of 19
15. (save_person b8 p4)
   added: (saved p4)
   goals met: 2 of 19
16. (go_north_east b8)
   changed: (x b8) from -12.5 to -11, (y b8) from 19.5 to 21
   goals met: 2 of 19
17. (save_person b8 p1)
   added: (saved p1)
   goals met: 3 of 19
18. (save_person b8 p7)
   added: (saved p7)
   goals met: 4 of 19
19. (go_north_west b8)
   changed: (x b8) from -11 to -12.5, (y b8) from 21 to 22.5
   goals met: 4 of 19
20. (go_north_east b8)
   changed: (x b8) from -12.5 to -11, (y b8) from 22.5 to 24
   goals met: 4 of 19
21. (go_north_east b8)
   changed: (x b8) from -11 to -9.5, (y b8) from 24 to 25.5
   goals met: 4 of 19
22. (go_north_east b8)
   changed: (x b8) from -9.5 to -8, (y b8) from 25.5 to 27
   goals met: 4 of 19
23. (go_north_east b8)
   changed: (x b8) from -8 to -6.5, (y b8) from 27 to 28.5
   goals met: 4 of 19
24. (go_north_east b8)
   changed: (x b8) from -6.5 to -5, (y b8) from 28.5 to 30
   goals met: 4 of 19
25. (go_north_east b8)
   changed: (x b8) from -5 to -3.5, (y b8) from 30 to 31.5
   goals met: 4 of 19
26. (go_north_east b8)
   changed: (x b8) from -3.5 to -2, (y b8) from 31.5 to 33
   goals met: 4 of 19
27. (go_north_east b8)
   changed: (x b8) from -2 to -0.5, (y b8) from 33 to 34.5
   goals met: 4 of 19
28. (go_north_east b8)
   changed: (x b8) from -0.5 to 1, (y b8) from 34.5 to 36
   goals met: 4 of 19
29. (go_north_east b8)
   changed: (x b8) from 1 to 2.5, (y b8) from 36 to 37.5
   goals met: 4 of 19
30. (save_person b8 p8)
   added: (saved p8)
   goals met: 5 of 19
31. (go_north_west b8)
   changed: (x b8) from 2.5 to 1, (y b8) from 37.5 to 39
   goals met: 5 of 19
32. (save_person b8 p3)
   added: (saved p3)
   goals met: 6 of 19
33. (go_north_west b8)
   changed: (x b8) from 1 to -0.5, (y b8) from 39 to 40.5
   goals met: 6 of 19
34. (go_north_west b8)
   changed: (x b8) from -0.5 to -2, (y b8) from 40.5 to 42
   goals met: 6 of 19
35. (go_north_west b8)
   changed: (x b8) from -2 to -3.5, (y b8) from 42 to 43.5
   goals met: 6 of 19
36. (go_south_east b8)
   changed: (x b8) from -3.5 to -5.5, (y b8) from 43.5 to 41.5
   goals met: 6 of 19
37. (go_north_east b8)
   changed: (x b8) from -5.5 to -4, (y b8) from 41.5 to 43
   goals met: 6 of 19
38. (go_north_east b8)
   changed: (x b8) from -4 to -2.5, (y b8) from 43 to 44.5
   goals met: 6 of 19
39. (go_north_east b8)
   changed: (x b8) from -2.5 to -1, (y b8) from 44.5 to 46
   goals met: 6 of 19
40. (go_north_east b8)
   changed: (x b8) from -1 to 0.5, (y b8) from 46 to 47.5
   goals met: 6 of 19
41. (save_person b8 p12)
   added: (saved p12)
   goals met: 7 of 19
42. (go_north_west b8)
   changed: (x b8) from 0.5 to -1, (y b8) from 47.5 to 49
   goals met: 7 of 19
43. (go_north_east b8)
   changed: (x b8) from -1 to 0.5, (y b8) from 49 to 50.5
   goals met: 7 of 19
44. (go_north_east b8)
   changed: (x b8) from 0.5 to 2, (y b8) from 50.5 to 52
   goals met: 7 of 19
45. (go_north_east b8)
   changed: (x b8) from 2 to 3.5, (y b8) from 52 to 53.5
   goals met: 7 of 19
46. (go_north_east b8)
   changed: (x b8) from 3.5 to 5, (y b8) from 53.5 to 55
   goals met: 7 of 19
47. (go_north_east b8)
   changed: (x b8) from 5 to 6.5, (y b8) from 55 to 56.5
   goals met: 7 of 19
48. (go_north_east b8)
   changed: (x b8) from 6.5 to 8, (y b8) from 56.5 to 58
   goals met: 7 of 19
49. (go_north_east b5)
   changed: (x b5) from -1 to 0.5, (y b5) from 0 to 1.5
   goals met: 7 of 19
50. (go_north_east b5)
   changed: (x b5) from 0.5 to 2, (y b5) from 1.5 to 3
   goals met: 7 of 19
51. (go_north_east b5)
   changed: (x b5) from 2 to 3.5, (y b5) from 3 to 4.5
   goals met: 7 of 19
52. (go_north_east b5)
   changed: (x b5) from 3.5 to 5, (y b5) from 4.5 to 6
   goals met: 7 of 19
53. (go_north_west b8)
   changed: (x b8) from 8 to 6.5, (y b8) from 58 to 59.5
   goals met: 7 of 19
54. (go_north_west b8)
   changed: (x b8) from 6.5 to 5, (y b8) from 59.5 to 61
   goals met: 7 of 19
55. (save_person b8 p17)
   added: (saved p17)
   goals met: 8 of 19
56. (go_north_west b8)
   changed: (x b8) from 5 to 3.5, (y b8) from 61 to 62.5
   goals met: 8 of 19
57. (go_north_west b8)
   changed: (x b8) from 3.5 to 2, (y b8) from 62.5 to 64
   goals met: 8 of 19
58. (go_north_west b8)
   changed: (x b8) from 2 to 0.5, (y b8) from 64 to 65.5
   goals met: 8 of 19
59. (save_person b8 p2)
   added: (saved p2)
   goals met: 9 of 19
60. (go_north_west b8)
   changed: (x b8) from 0.5 to -1, (y b8) from 65.5 to 67
   goals met: 9 of 19
61. (go_north_west b8)
   changed: (x b8) from -1 to -2.5, (y b8) from 67 to 68.5
   goals met: 9 of 19
62. (go_north_east b8)
   changed: (x b8) from -2.5 to -1, (y b8) from 68.5 to 70
   goals met: 9 of 19
63. (save_person b8 p5)
   added: (saved p5)
   goals met: 10 of 19
64. (save_person b8 p9)
   added: (saved p9)
   goals met: 11 of 19
65. (save_person b8 p10)
   added: (saved p10)
   goals met: 12 of 19
66. (save_person b8 p16)
   added: (saved p16)
   goals met: 13 of 19
67. (go_north_east b8)
   changed: (x b8) from -1 to 0.5, (y b8) from 70 to 71.5
   goals met: 13 of 19
68. (go_north_east b8)
   changed: (x b8) from 0.5 to 2, (y b8) from 71.5 to 73
   goals met: 13 of 19
69. (go_north_east b8)
   changed: (x b8) from 2 to 3.5, (y b8) from 73 to 74.5
   goals met: 13 of 19
70. (save_person b8 p0)
   added: (saved p0)
   goals met: 14 of 19
71. (go_north_east b8)
   changed: (x b8) from 3.5 to 5, (y b8) from 74.5 to 76
   goals met: 14 of 19
72. (go_north_east b8)
   changed: (x b8) from 5 to 6.5, (y b8) from 76 to 77.5
   goals met: 14 of 19
73. (go_north_east b8)
   changed: (x b8) from 6.5 to 8, (y b8) from 77.5 to 79
   goals met: 14 of 19
74. (go_north_east b8)
   changed: (x b8) from 8 to 9.5, (y b8) from 79 to 80.5
   goals met: 14 of 19
75. (go_north_east b8)
   changed: (x b8) from 9.5 to 11, (y b8) from 80.5 to 82
   goals met: 14 of 19
76. (go_north_west b8)
   changed: (x b8) from 11 to 9.5, (y b8) from 82 to 83.5
   goals met: 14 of 19
77. (go_north_west b8)
   changed: (x b8) from 9.5 to 8, (y b8) from 83.5 to 85
   goals met: 14 of 19
78. (go_north_west b8)
   changed: (x b8) from 8 to 6.5, (y b8) from 85 to 86.5
   goals met: 14 of 19
79. (save_person b8 p11)
   added: (saved p11)
   goals met: 15 of 19
80. (save_person b8 p15)
   added: (saved p15)
   goals met: 16 of 19
81. (save_person b8 p18)
   added: (saved p18)
   goals met: 17 of 19
82. (go_north_west b8)
   changed: (x b8) from 6.5 to 5, (y b8) from 86.5 to 88
   goals met: 17 of 19
83. (go_north_west b8)
   changed: (x b8) from 5 to 3.5, (y b8) from 88 to 89.5
   goals met: 17 of 19
84. (go_north_west b8)
   changed: (x b8) from 3.5 to 2, (y b8) from 89.5 to 91
   goals met: 17 of 19
85. (go_north_west b8)
   changed: (x b8) from 2 to 0.5, (y b8) from 91 to 92.5
   goals met: 17 of 19
86. (go_north_west b8)
   changed: (x b8) from 0.5 to -1, (y b8) from 92.5 to 94
   goals met: 17 of 19
87. (save_person b8 p6)
   added: (saved p6)
   goals met: 18 of 19
88. (go_north_west b5)
   changed: (x b5) from 5 to 3.5, (y b5) from 6 to 7.5
   goals met: 18 of 19
89. (go_north_west b5)
   changed: (x b5) from 3.5 to 2, (y b5) from 7.5 to 9
   goals met: 18 of 19
90. (go_north_west b5)
   changed: (x b5) from 2 to 0.5, (y b5) from 9 to 10.5
   goals met: 18 of 19
91. (go_north_west b5)
   changed: (x b5) from 0.5 to -1, (y b5) from 10.5 to 12
   goals met: 18 of 19
92. (save_person b5 p14)
   added: (saved p14)
   goals met: 19 of 19
